Repository: HazemSala7/Doctor-palestine
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Welcome back!
ar: مرحبا بعودتك!

source: Ok
ar: حسنا

source: Logout
ar: تسجيل خروج

source: Login
ar: تسجيل دخول

source: Log in to access your account
ar: سجل الدخول للوصول إلى حسابك

source: Job Number
ar: الرقم الوظيفي

source: Please enter your job number
ar: الرجاء إدخال الرقم الوظيفي

source: Password
ar: كلمة المرور

source: Please enter your password
ar: الرجاء إدخال كلمة المرور

source: Remember me
ar: تذكرني

source: Forgot your password?
ar: هل نسيت كلمة المرور؟

source: Employee Operations
ar: عمليات الموظف

source: Attendance Registration
ar: تسجيل حضور

source: Record your attendance time
ar: قم بتسجيل وقت الحضور الخاص بك

source: Record your check-in time
ar: قم بتسجيل وقت الانصراف الخاص بك

source: Request for Sick Leave
ar: طلب اجازه مرضية

source: Easily request sick leave
ar: قم بطلب اجازه مرضيه بسهولة

source: Request for Exit Permit
ar: طلب اذن خروج

source: Submit an exit permit application
ar: قم بتقديم طلب اذن خروج

source: Confirm Logout
ar: تأكيد تسجيل الخروج

source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: You have successfully logged in
ar: تم تسجيل الدخول بنجاح

# fingerprint_login_successfully
source: Logged in successfully with fingerprint
ar: تم تسجيل الدخول باستخدام البصمة بنجاح

source: Attendance Recording - Fingerprint
ar: تسجيل حضور - البصمة

source: Register attendance using your fingerprint
ar: قم بتسجيل الحضور باستخدام بصمة إصبعك

# fingerprint_verification
source: Fingerprint verification in progress...
ar: جاري التحقق من البصمة...

source: Click to register
ar: اضغط للتسجيل

source: Keep your finger on the fingerprint reader until verification is complete.
ar: حافظ على إصبعك على قارئ البصمة حتى يتم التحقق.

source: Place your finger on the sensor to check-in
ar: ضع إصبعك على المستشعر للتحقق

source: You are too far away
ar: أنت بعيد جدًا

source: Logout - Fingerprint
ar: تسجيل الخروج - البصمة

source: Log out with your fingerprint
ar: قم بتسجيل الخروج باستخدام بصمة إصبعك

source: Cancel
ar: إلغاء

source: You have successfully logged out
ar: تم تسجيل الخروج بنجاح

source: You have failed to log in, please try again later.
ar: فشلت عملية تسجيل الدخول , الرجاء المحاولة فيما بعد

# fingerprint_logout_successfully
source: Logged out successfully with fingerprint
ar: تم تسجيل الخروج باستخدام البصمة بنجاح

source: Date of Permission
ar: تاريخ الإذن

source: Select the permission date
ar: اختر تاريخ الإذن

source: Please select a date of authorization
ar: يرجى اختيار تاريخ الإذن

source: From the Hour
ar: من الساعة

source: Select start time
ar: اختر وقت البداية

source: Please select a start time
ar: يرجى اختيار وقت البداية

source: To the Hour
ar: إلى الساعة

source: Select end time
ar: اختر وقت النهاية

source: Please select an end time
ar: يرجى اختيار وقت النهاية

source: Permission Description
ar: وصف الإذن

source: Enter permission description
ar: أدخل وصف الإذن

source: Please enter a permission description
ar: يرجى إدخال وصف الإذن

source: Submit Request
ar: إرسال الطلب

source: Request Sick Leave
ar: طلب إجازة مرضية

source: Vacation Start Date
ar: تاريخ بداية الإجازة

source: Select start date
ar: اختر تاريخ البداية

source: Please select a start date
ar: يرجى اختيار تاريخ البداية

source: Vacation End Date
ar: تاريخ نهاية الإجازة

source: Select end date
ar: اختر تاريخ النهاية

source: Please select an end date
ar: يرجى اختيار تاريخ النهاية

source: Contact Number During Vacation
ar: رقم الاتصال خلال الإجازة

source: Enter contact number
ar: أدخل رقم الاتصال

source: Please enter your contact number
ar: يرجى إدخال رقم الاتصال

source: Please enter a valid number
ar: يرجى إدخال رقم صالح

source: Description of the Holiday
ar: وصف الإجازة

source: Enter a vacation description
ar: أدخل وصف الإجازة

source: Please enter a description of the leave
ar: يرجى إدخال وصف الإجازة

source: Additional Notes
ar: ملاحظات إضافية

source: you are far away
ar: أنت على بعد

source: Meter. Please approach the site to register.
ar: مترًا. يُرجى الاقتراب من الموقع للتسجيل.

source: The exit permission request has been added successfully
ar: تم إضافة طلب إذن الخروج بنجاح

source: Sick leave request has been added successfully
ar: تم اضافة طلب الاجازة المرضية بنجاح

source: Select Language
ar: اختر اللغة

source: Employee Transactions
ar: سجل البيانات

# see_employee_transactions
source: See your transactions
ar: قم بعرض سجل بياناتك

# no_transactions
source: No transactions found for this month
ar: لا توجد معاملات لهذا الشهر

source: Check-In
ar: وقت الحضور

source: Check-Out
ar: وقت الانصراف

source: Total Hours
ar: إجمالي الساعات

source: Overtime
ar: العمل الإضافي

source: Notes
ar: ملاحظات

# status_completed
source: Completed
ar: مكتمل

# status_pending
source: Pending
ar: معلق

# status_rejected
source: Rejected
ar: مرفوض

source: Date
ar: التاريخ

# employee_attendance_record
source: Employees Attendance Records
ar: سجل الحضور و الغياب للموظفين

# view_employee_attendance_and_leave_reports
source: View employees attendance and leave reports
ar: قم برؤية تقارير الحضور و الانصارف للموظفين

# enter_notes
source: Enter notes (optional)
ar: أدخل ملاحظات (اختياري)
